*** synapse-core/src/identity/infrastructure/ed25519_signer.rs:43:9: replace Ed25519Signer::secret_key_bytes -> [u8; 32] with [0; 32]

*** mutation diff:
--- synapse-core/src/identity/infrastructure/ed25519_signer.rs
+++ replace Ed25519Signer::secret_key_bytes -> [u8; 32] with [0; 32]
@@ -35,17 +35,17 @@
         rand::thread_rng().fill_bytes(&mut secret);
         let signing_key = SigningKey::from_bytes(&secret);
         let verifying_key = signing_key.verifying_key();
         Self { signing_key, verifying_key }
     }
 
     /// Returns the raw 32-byte secret key material.
     pub fn secret_key_bytes(&self) -> [u8; 32] {
-        self.signing_key.to_bytes()
+        [0; 32] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl KeySigner for Ed25519Signer {
     fn sign(&self, data: &[u8]) -> Vec<u8> {
         let signature = self.signing_key.sign(data);
         signature.to_bytes().to_vec()
     }

---- identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works' (91350) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:121:9:
assertion failed: reconstructed.verify(msg, &sig)

failures:
    identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
