*** synapse-core/src/gateway/api.rs:14:5: replace build_router -> Router with Default::default()

*** mutation diff:
--- synapse-core/src/gateway/api.rs
+++ replace build_router -> Router with Default::default()
@@ -6,20 +6,17 @@
 #[derive(Serialize)]
 struct HealthResponse {
     status: &'static str,
     version: &'static str,
     swarm_nodes: usize,
 }
 
 pub fn build_router() -> Router {
-    Router::new()
-        .route("/health", get(health))
-        .route("/v1/models", get(catalog::list_models))
-        .route("/v1/chat/completions", axum::routing::post(router::chat_completions))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn health() -> Json<HealthResponse> {
     Json(HealthResponse { status: "ok", version: env!("CARGO_PKG_VERSION"), swarm_nodes: 0 })
 }
 
 #[cfg(test)]
 mod tests {

---- gateway::api::tests::health_endpoint_returns_ok stdout ----

thread 'gateway::api::tests::health_endpoint_returns_ok' (35049) panicked at synapse-core/src/gateway/api.rs:37:9:
assertion `left == right` failed
  left: 404
 right: 200

failures:
    gateway::api::tests::health_endpoint_returns_ok

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
