*** synapse-core/src/gateway/catalog.rs:37:5: replace list_models -> Json<Vec<ModelEntry>> with Json::from(vec![])

*** mutation diff:
--- synapse-core/src/gateway/catalog.rs
+++ replace list_models -> Json<Vec<ModelEntry>> with Json::from(vec![])
@@ -29,19 +29,17 @@
             context_window: m.context_window,
             license: m.license.clone(),
         }
     }
 }
 
 /// Loads the catalog from config and returns models as JSON.
 pub async fn list_models() -> Json<Vec<ModelEntry>> {
-    let catalog = load_catalog();
-    let entries: Vec<ModelEntry> = catalog.list().iter().map(ModelEntry::from).collect();
-    Json(entries)
+    Json::from(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Loads the Synapse catalog from `config/models.toml`.
 fn load_catalog() -> Catalog {
     let mut catalog = Catalog::new();
     // Hardcoded for now; Task 5.3 will load from config/models.toml dynamically.
     let kimi = ModelEntity::new(
         ModelId::new("kimi-k3").unwrap(),

---- gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs stdout ----

thread 'gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs' (35979) panicked at synapse-core/src/gateway/catalog.rs:104:62:
called `Option::unwrap()` on a `None` value

---- gateway::catalog::tests::list_models_returns_non_empty_array stdout ----

thread 'gateway::catalog::tests::list_models_returns_non_empty_array' (35981) panicked at synapse-core/src/gateway/catalog.rs:92:9:
assertion failed: !models.is_empty()

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_non_empty_array

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
