*** synapse-core/src/gateway/catalog.rs:44:5: replace load_catalog -> Catalog with Default::default()

*** mutation diff:
--- synapse-core/src/gateway/catalog.rs
+++ replace load_catalog -> Catalog with Default::default()
@@ -36,34 +36,17 @@
 pub async fn list_models() -> Json<Vec<ModelEntry>> {
     let catalog = load_catalog();
     let entries: Vec<ModelEntry> = catalog.list().iter().map(ModelEntry::from).collect();
     Json(entries)
 }
 
 /// Loads the Synapse catalog from `config/models.toml`.
 fn load_catalog() -> Catalog {
-    let mut catalog = Catalog::new();
-    // Hardcoded for now; Task 5.3 will load from config/models.toml dynamically.
-    let kimi = ModelEntity::new(
-        ModelId::new("kimi-k3").unwrap(),
-        "Kimi K3".into(),
-        "Moonshot AI's frontier MoE. 2.8T total params, ~103B active, 896 experts, KDA linear attention, 1M context. Open-weight (MIT modified).".into(),
-        "2.8T".into(),
-        896,
-        16,
-        1.5,
-        12.0,
-        1_000_000,
-        "MIT".into(),
-        "moonshotai/Kimi-K3".into(),
-        None,
-    );
-    catalog.register(kimi).ok();
-    catalog
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use axum::body::Body;
     use axum::http::{Request, StatusCode};
     use tower::ServiceExt;

---- gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs stdout ----

thread 'gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs' (36726) panicked at synapse-core/src/gateway/catalog.rs:89:62:
called `Option::unwrap()` on a `None` value

---- gateway::catalog::tests::list_models_returns_non_empty_array stdout ----

thread 'gateway::catalog::tests::list_models_returns_non_empty_array' (36728) panicked at synapse-core/src/gateway/catalog.rs:77:9:
assertion failed: !models.is_empty()

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_non_empty_array

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
