*** synapse-core/src/gateway/router.rs:37:5: replace default_priority -> String with String::new()

*** mutation diff:
--- synapse-core/src/gateway/router.rs
+++ replace default_priority -> String with String::new()
@@ -29,17 +29,17 @@
 #[derive(Debug, Serialize, Deserialize, PartialEq)]
 pub struct Choice {
     pub index: u32,
     pub message: Message,
     pub finish_reason: String,
 }
 
 fn default_priority() -> String {
-    "realtime".into()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 fn default_swarm_size() -> u32 {
     5
 }
 
 pub async fn chat_completions(
     Json(req): Json<ChatRequest>,
 ) -> Result<Json<ChatResponse>, StatusCode> {

---- gateway::router::default_tests::default_priority_is_not_empty stdout ----

thread 'gateway::router::default_tests::default_priority_is_not_empty' (37437) panicked at synapse-core/src/gateway/router.rs:155:9:
assertion failed: !default_priority().is_empty()

---- gateway::router::default_tests::default_priority_is_realtime stdout ----

thread 'gateway::router::default_tests::default_priority_is_realtime' (37438) panicked at synapse-core/src/gateway/router.rs:145:9:
assertion `left == right` failed
  left: ""
 right: "realtime"

failures:
    gateway::router::default_tests::default_priority_is_not_empty
    gateway::router::default_tests::default_priority_is_realtime

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
