*** synapse-core/src/identity/key_pair.rs:41:9: replace KeyPair::secret_key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))

*** mutation diff:
--- synapse-core/src/identity/key_pair.rs
+++ replace KeyPair::secret_key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))
@@ -33,17 +33,17 @@
 
     /// Returns a reference to the 32-byte public key.
     pub fn public_key_bytes(&self) -> &[u8; 32] {
         &self.public
     }
 
     /// Returns a reference to the 32-byte secret key.
     pub fn secret_key_bytes(&self) -> &[u8; 32] {
-        &self.secret
+        Box::leak(Box::new([1; 32])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl PartialEq for KeyPair {
     fn eq(&self, other: &Self) -> bool {
         self.public == other.public && self.secret == other.secret
     }
 }

---- identity::key_pair::tests::secret_key_bytes_returns_actual_secret stdout ----

thread 'identity::key_pair::tests::secret_key_bytes_returns_actual_secret' (42180) panicked at synapse-core/src/identity/key_pair.rs:102:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171, 171]

failures:
    identity::key_pair::tests::secret_key_bytes_returns_actual_secret

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
