*** synapse-core/src/gateway/router.rs:37:5: replace default_priority -> String with "xyzzy".into()

*** mutation diff:
--- synapse-core/src/gateway/router.rs
+++ replace default_priority -> String with "xyzzy".into()
@@ -29,17 +29,17 @@
 #[derive(Debug, Serialize, Deserialize, PartialEq)]
 pub struct Choice {
     pub index: u32,
     pub message: Message,
     pub finish_reason: String,
 }
 
 fn default_priority() -> String {
-    "realtime".into()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 fn default_swarm_size() -> u32 {
     5
 }
 
 pub async fn chat_completions(
     Json(req): Json<ChatRequest>,
 ) -> Result<Json<ChatResponse>, StatusCode> {

---- gateway::router::default_tests::default_priority_is_realtime stdout ----

thread 'gateway::router::default_tests::default_priority_is_realtime' (38047) panicked at synapse-core/src/gateway/router.rs:145:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "realtime"

failures:
    gateway::router::default_tests::default_priority_is_realtime

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
