*** synapse-core/src/gateway/router.rs:40:5: replace default_swarm_size -> u32 with 0

*** mutation diff:
--- synapse-core/src/gateway/router.rs
+++ replace default_swarm_size -> u32 with 0
@@ -32,17 +32,17 @@
     pub message: Message,
     pub finish_reason: String,
 }
 
 fn default_priority() -> String {
     "realtime".into()
 }
 fn default_swarm_size() -> u32 {
-    5
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn chat_completions(
     Json(req): Json<ChatRequest>,
 ) -> Result<Json<ChatResponse>, StatusCode> {
     Ok(Json(ChatResponse {
         id: "chatcmpl-0001".into(),
         object: "chat.completion".into(),

---- gateway::router::default_tests::default_swarm_size_is_5 stdout ----

thread 'gateway::router::default_tests::default_swarm_size_is_5' (38734) panicked at synapse-core/src/gateway/router.rs:150:9:
assertion `left == right` failed
  left: 0
 right: 5

---- gateway::router::default_tests::default_swarm_size_is_nonzero stdout ----

thread 'gateway::router::default_tests::default_swarm_size_is_nonzero' (38735) panicked at synapse-core/src/gateway/router.rs:160:9:
assertion failed: default_swarm_size() > 0

failures:
    gateway::router::default_tests::default_swarm_size_is_5
    gateway::router::default_tests::default_swarm_size_is_nonzero

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
