*** synapse-core/src/gateway/router.rs:40:5: replace default_swarm_size -> u32 with 1

*** mutation diff:
--- synapse-core/src/gateway/router.rs
+++ replace default_swarm_size -> u32 with 1
@@ -32,17 +32,17 @@
     pub message: Message,
     pub finish_reason: String,
 }
 
 fn default_priority() -> String {
     "realtime".into()
 }
 fn default_swarm_size() -> u32 {
-    5
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub async fn chat_completions(
     Json(req): Json<ChatRequest>,
 ) -> Result<Json<ChatResponse>, StatusCode> {
     Ok(Json(ChatResponse {
         id: "chatcmpl-0001".into(),
         object: "chat.completion".into(),

---- gateway::router::default_tests::default_swarm_size_is_5 stdout ----

thread 'gateway::router::default_tests::default_swarm_size_is_5' (39404) panicked at synapse-core/src/gateway/router.rs:150:9:
assertion `left == right` failed
  left: 1
 right: 5

failures:
    gateway::router::default_tests::default_swarm_size_is_5

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
