*** synapse-core/src/identity/infrastructure/ed25519_signer.rs:49:9: replace <impl KeySigner for Ed25519Signer>::sign -> Vec<u8> with vec![0]

*** mutation diff:
--- synapse-core/src/identity/infrastructure/ed25519_signer.rs
+++ replace <impl KeySigner for Ed25519Signer>::sign -> Vec<u8> with vec![0]
@@ -41,18 +41,17 @@
     /// Returns the raw 32-byte secret key material.
     pub fn secret_key_bytes(&self) -> [u8; 32] {
         self.signing_key.to_bytes()
     }
 }
 
 impl KeySigner for Ed25519Signer {
     fn sign(&self, data: &[u8]) -> Vec<u8> {
-        let signature = self.signing_key.sign(data);
-        signature.to_bytes().to_vec()
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     fn verify(&self, data: &[u8], signature: &[u8]) -> bool {
         let Ok(sig) = ed25519_dalek::Signature::from_slice(signature) else {
             return false;
         };
         self.verifying_key.verify(data, &sig).is_ok()
     }

---- identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip' (93313) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:80:9:
assertion failed: signer.verify(message, &signature)

---- identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works' (93312) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:120:9:
assertion failed: reconstructed.verify(msg, &sig)

failures:
    identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works
    identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
