*** synapse-core/src/identity/infrastructure/ed25519_signer.rs:54:9: replace <impl KeySigner for Ed25519Signer>::verify -> bool with true

*** mutation diff:
--- synapse-core/src/identity/infrastructure/ed25519_signer.rs
+++ replace <impl KeySigner for Ed25519Signer>::verify -> bool with true
@@ -46,20 +46,17 @@
 
 impl KeySigner for Ed25519Signer {
     fn sign(&self, data: &[u8]) -> Vec<u8> {
         let signature = self.signing_key.sign(data);
         signature.to_bytes().to_vec()
     }
 
     fn verify(&self, data: &[u8], signature: &[u8]) -> bool {
-        let Ok(sig) = ed25519_dalek::Signature::from_slice(signature) else {
-            return false;
-        };
-        self.verifying_key.verify(data, &sig).is_ok()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn public_key_bytes(&self) -> [u8; 32] {
         self.verifying_key.to_bytes()
     }
 }
 
 #[cfg(test)]

---- identity::infrastructure::ed25519_signer::tests::garbage_signature_slice_fails_verify stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::garbage_signature_slice_fails_verify' (94619) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:124:9:
assertion failed: !signer.verify(b"data", &[0u8; 3])

---- identity::infrastructure::ed25519_signer::tests::wrong_message_fails_verification stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::wrong_message_fails_verification' (94623) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:97:9:
assertion failed: !signer.verify(b"tampered", &signature)

---- identity::infrastructure::ed25519_signer::tests::wrong_signature_fails_verification stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::wrong_signature_fails_verification' (94624) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:90:9:
assertion failed: !signer.verify(message, &bad_sig)

failures:
    identity::infrastructure::ed25519_signer::tests::different_signer_fails_verification
    identity::infrastructure::ed25519_signer::tests::garbage_signature_slice_fails_verify
    identity::infrastructure::ed25519_signer::tests::wrong_message_fails_verification
    identity::infrastructure::ed25519_signer::tests::wrong_signature_fails_verification

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
