*** synapse-core/src/identity/infrastructure/ed25519_signer.rs:54:9: replace <impl KeySigner for Ed25519Signer>::verify -> bool with false

*** mutation diff:
--- synapse-core/src/identity/infrastructure/ed25519_signer.rs
+++ replace <impl KeySigner for Ed25519Signer>::verify -> bool with false
@@ -46,20 +46,17 @@
 
 impl KeySigner for Ed25519Signer {
     fn sign(&self, data: &[u8]) -> Vec<u8> {
         let signature = self.signing_key.sign(data);
         signature.to_bytes().to_vec()
     }
 
     fn verify(&self, data: &[u8], signature: &[u8]) -> bool {
-        let Ok(sig) = ed25519_dalek::Signature::from_slice(signature) else {
-            return false;
-        };
-        self.verifying_key.verify(data, &sig).is_ok()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn public_key_bytes(&self) -> [u8; 32] {
         self.verifying_key.to_bytes()
     }
 }
 
 #[cfg(test)]

---- identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip' (95259) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:78:9:
assertion failed: signer.verify(message, &signature)

---- identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works' (95258) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:118:9:
assertion failed: reconstructed.verify(msg, &sig)

failures:
    identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works
    identity::infrastructure::ed25519_signer::tests::sign_and_verify_roundtrip

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
