*** synapse-core/src/identity/infrastructure/ed25519_signer.rs:61:9: replace <impl KeySigner for Ed25519Signer>::public_key_bytes -> [u8; 32] with [0; 32]

*** mutation diff:
--- synapse-core/src/identity/infrastructure/ed25519_signer.rs
+++ replace <impl KeySigner for Ed25519Signer>::public_key_bytes -> [u8; 32] with [0; 32]
@@ -53,17 +53,17 @@
     fn verify(&self, data: &[u8], signature: &[u8]) -> bool {
         let Ok(sig) = ed25519_dalek::Signature::from_slice(signature) else {
             return false;
         };
         self.verifying_key.verify(data, &sig).is_ok()
     }
 
     fn public_key_bytes(&self) -> [u8; 32] {
-        self.verifying_key.to_bytes()
+        [0; 32] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works stdout ----

thread 'identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works' (95915) panicked at synapse-core/src/identity/infrastructure/ed25519_signer.rs:121:9:
assertion failed: reconstructed.verify(msg, &sig)

failures:
    identity::infrastructure::ed25519_signer::tests::new_from_raw_keys_works

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
