*** synapse-core/src/identity/key_pair.rs:36:9: replace KeyPair::public_key_bytes -> &[u8; 32] with Box::leak(Box::new([0; 32]))

*** mutation diff:
--- synapse-core/src/identity/key_pair.rs
+++ replace KeyPair::public_key_bytes -> &[u8; 32] with Box::leak(Box::new([0; 32]))
@@ -28,17 +28,17 @@
         let mut rng = rand::thread_rng();
         rng.fill_bytes(&mut public);
         rng.fill_bytes(&mut secret);
         Self { public, secret }
     }
 
     /// Returns a reference to the 32-byte public key.
     pub fn public_key_bytes(&self) -> &[u8; 32] {
-        &self.public
+        Box::leak(Box::new([0; 32])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the 32-byte secret key.
     pub fn secret_key_bytes(&self) -> &[u8; 32] {
         &self.secret
     }
 }

---- identity::node::tests::derive_node_id_differs_for_different_keys stdout ----

thread 'identity::node::tests::derive_node_id_differs_for_different_keys' (40259) panicked at synapse-core/src/identity/node.rs:161:9:
assertion `left != right` failed
  left: NodeId([102, 104, 122, 173, 248, 98, 189, 119, 108, 143, 193, 139, 142, 159, 142, 32, 8, 151, 20, 133, 110, 226, 51, 179, 144, 42, 89, 29, 13, 95, 41, 37])
 right: NodeId([102, 104, 122, 173, 248, 98, 189, 119, 108, 143, 193, 139, 142, 159, 142, 32, 8, 151, 20, 133, 110, 226, 51, 179, 144, 42, 89, 29, 13, 95, 41, 37])

failures:
    identity::node::tests::derive_node_id_differs_for_different_keys

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
