*** synapse-core/src/identity/key_pair.rs:36:9: replace KeyPair::public_key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))

*** mutation diff:
--- synapse-core/src/identity/key_pair.rs
+++ replace KeyPair::public_key_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))
@@ -28,17 +28,17 @@
         let mut rng = rand::thread_rng();
         rng.fill_bytes(&mut public);
         rng.fill_bytes(&mut secret);
         Self { public, secret }
     }
 
     /// Returns a reference to the 32-byte public key.
     pub fn public_key_bytes(&self) -> &[u8; 32] {
-        &self.public
+        Box::leak(Box::new([1; 32])) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the 32-byte secret key.
     pub fn secret_key_bytes(&self) -> &[u8; 32] {
         &self.secret
     }
 }

---- identity::node::tests::derive_node_id_differs_for_different_keys stdout ----

thread 'identity::node::tests::derive_node_id_differs_for_different_keys' (40889) panicked at synapse-core/src/identity/node.rs:161:9:
assertion `left != right` failed
  left: NodeId([114, 205, 110, 132, 34, 196, 7, 251, 109, 9, 134, 144, 241, 19, 11, 125, 237, 126, 194, 247, 245, 225, 211, 11, 217, 213, 33, 240, 21, 54, 55, 147])
 right: NodeId([114, 205, 110, 132, 34, 196, 7, 251, 109, 9, 134, 144, 241, 19, 11, 125, 237, 126, 194, 247, 245, 225, 211, 11, 217, 213, 33, 240, 21, 54, 55, 147])

failures:
    identity::node::tests::derive_node_id_differs_for_different_keys

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
