*** synapse-core/src/identity/key_pair.rs:47:52: replace == with != in <impl PartialEq for KeyPair>::eq

*** mutation diff:
--- synapse-core/src/identity/key_pair.rs
+++ replace == with != in <impl PartialEq for KeyPair>::eq
@@ -39,17 +39,17 @@
     /// Returns a reference to the 32-byte secret key.
     pub fn secret_key_bytes(&self) -> &[u8; 32] {
         &self.secret
     }
 }
 
 impl PartialEq for KeyPair {
     fn eq(&self, other: &Self) -> bool {
-        self.public == other.public && self.secret == other.secret
+        self.public == other.public && self.secret != /* ~ changed by cargo-mutants ~ */ other.secret
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- identity::key_pair::tests::different_secret_not_equal stdout ----

thread 'identity::key_pair::tests::different_secret_not_equal' (45425) panicked at synapse-core/src/identity/key_pair.rs:95:9:
assertion `left != right` failed
  left: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }
 right: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4] }

---- identity::key_pair::tests::same_keys_are_equal stdout ----

thread 'identity::key_pair::tests::same_keys_are_equal' (45429) panicked at synapse-core/src/identity/key_pair.rs:81:9:
assertion `left == right` failed
  left: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }
 right: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }

failures:
    identity::key_pair::tests::different_secret_not_equal
    identity::key_pair::tests::same_keys_are_equal

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
