*** synapse-core/src/identity/key_pair.rs:47:9: replace <impl PartialEq for KeyPair>::eq -> bool with true

*** mutation diff:
--- synapse-core/src/identity/key_pair.rs
+++ replace <impl PartialEq for KeyPair>::eq -> bool with true
@@ -39,17 +39,17 @@
     /// Returns a reference to the 32-byte secret key.
     pub fn secret_key_bytes(&self) -> &[u8; 32] {
         &self.secret
     }
 }
 
 impl PartialEq for KeyPair {
     fn eq(&self, other: &Self) -> bool {
-        self.public == other.public && self.secret == other.secret
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- identity::key_pair::tests::different_secret_not_equal stdout ----

thread 'identity::key_pair::tests::different_secret_not_equal' (42855) panicked at synapse-core/src/identity/key_pair.rs:95:9:
assertion `left != right` failed
  left: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }
 right: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4] }

---- identity::key_pair::tests::different_public_not_equal stdout ----

thread 'identity::key_pair::tests::different_public_not_equal' (42854) panicked at synapse-core/src/identity/key_pair.rs:88:9:
assertion `left != right` failed
  left: KeyPair { public: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }
 right: KeyPair { public: [3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3], secret: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2] }

failures:
    identity::key_pair::tests::different_public_not_equal
    identity::key_pair::tests::different_secret_not_equal

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
