*** synapse-core/src/identity/node.rs:71:9: replace Node::update_reputation -> Option<DomainEvent> with None

*** mutation diff:
--- synapse-core/src/identity/node.rs
+++ replace Node::update_reputation -> Option<DomainEvent> with None
@@ -63,28 +63,17 @@
         NodeId::from_public_key(keypair.public_key_bytes())
     }
 
     /// Updates the node's reputation score.
     ///
     /// The score is clamped to `[0, MAX_REPUTATION]`.
     /// Returns an event if the score changed.
     pub fn update_reputation(&mut self, new_score: u16) -> Option<DomainEvent> {
-        let clamped = new_score.min(MAX_REPUTATION);
-        if clamped == self.reputation {
-            return None;
-        }
-        let old = self.reputation;
-        self.reputation = clamped;
-        Some(DomainEvent::ReputationChanged {
-            event_id: uuid::Uuid::new_v4(),
-            node_id: self.node_id.to_string(),
-            old_score: old,
-            new_score: clamped,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if this node meets the minimum reputation threshold.
     pub fn meets_reputation(&self, minimum: u16) -> bool {
         self.reputation >= minimum
     }
 }

---- identity::node::tests::update_reputation_changes_score stdout ----

thread 'identity::node::tests::update_reputation_changes_score' (46179) panicked at synapse-core/src/identity/node.rs:167:49:
called `Option::unwrap()` on a `None` value

---- identity::node::tests::update_reputation_clamps_to_zero stdout ----

thread 'identity::node::tests::update_reputation_clamps_to_zero' (46181) panicked at synapse-core/src/identity/node.rs:191:9:
assertion `left == right` failed
  left: 100
 right: 0

---- identity::node::tests::update_reputation_clamps_to_max stdout ----

thread 'identity::node::tests::update_reputation_clamps_to_max' (46180) panicked at synapse-core/src/identity/node.rs:183:9:
assertion `left == right` failed
  left: 100
 right: 1000

failures:
    identity::node::tests::update_reputation_changes_score
    identity::node::tests::update_reputation_clamps_to_max
    identity::node::tests::update_reputation_clamps_to_zero

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
