*** synapse-core/src/identity/node.rs:72:20: replace == with != in Node::update_reputation

*** mutation diff:
--- synapse-core/src/identity/node.rs
+++ replace == with != in Node::update_reputation
@@ -64,17 +64,17 @@
     }
 
     /// Updates the node's reputation score.
     ///
     /// The score is clamped to `[0, MAX_REPUTATION]`.
     /// Returns an event if the score changed.
     pub fn update_reputation(&mut self, new_score: u16) -> Option<DomainEvent> {
         let clamped = new_score.min(MAX_REPUTATION);
-        if clamped == self.reputation {
+        if clamped != /* ~ changed by cargo-mutants ~ */ self.reputation {
             return None;
         }
         let old = self.reputation;
         self.reputation = clamped;
         Some(DomainEvent::ReputationChanged {
             event_id: uuid::Uuid::new_v4(),
             node_id: self.node_id.to_string(),
             old_score: old,

---- identity::node::tests::update_reputation_no_event_if_unchanged stdout ----

thread 'identity::node::tests::update_reputation_no_event_if_unchanged' (46882) panicked at synapse-core/src/identity/node.rs:212:9:
assertion failed: event.is_none()

---- identity::node::tests::update_reputation_clamps_to_max stdout ----

thread 'identity::node::tests::update_reputation_clamps_to_max' (46880) panicked at synapse-core/src/identity/node.rs:194:9:
assertion `left == right` failed
  left: 100
 right: 1000

---- identity::node::tests::update_reputation_clamps_to_zero stdout ----

thread 'identity::node::tests::update_reputation_clamps_to_zero' (46881) panicked at synapse-core/src/identity/node.rs:202:9:
assertion `left == right` failed
  left: 100
 right: 0

failures:
    identity::node::tests::update_reputation_changes_score
    identity::node::tests::update_reputation_clamps_to_max
    identity::node::tests::update_reputation_clamps_to_zero
    identity::node::tests::update_reputation_no_event_if_unchanged

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
