*** synapse-core/src/identity/node.rs:87:9: replace Node::meets_reputation -> bool with true

*** mutation diff:
--- synapse-core/src/identity/node.rs
+++ replace Node::meets_reputation -> bool with true
@@ -79,17 +79,17 @@
             node_id: self.node_id.to_string(),
             old_score: old,
             new_score: clamped,
         })
     }
 
     /// Returns true if this node meets the minimum reputation threshold.
     pub fn meets_reputation(&self, minimum: u16) -> bool {
-        self.reputation >= minimum
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn test_keypair() -> KeyPair {

---- identity::node::tests::meets_reputation_below_threshold stdout ----

thread 'identity::node::tests::meets_reputation_below_threshold' (47538) panicked at synapse-core/src/identity/node.rs:236:9:
assertion failed: !node.meets_reputation(300)

failures:
    identity::node::tests::meets_reputation_below_threshold

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
