*** synapse-core/src/identity/node.rs:87:9: replace Node::meets_reputation -> bool with false

*** mutation diff:
--- synapse-core/src/identity/node.rs
+++ replace Node::meets_reputation -> bool with false
@@ -79,17 +79,17 @@
             node_id: self.node_id.to_string(),
             old_score: old,
             new_score: clamped,
         })
     }
 
     /// Returns true if this node meets the minimum reputation threshold.
     pub fn meets_reputation(&self, minimum: u16) -> bool {
-        self.reputation >= minimum
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn test_keypair() -> KeyPair {

---- identity::node::tests::meets_reputation_above_threshold stdout ----

thread 'identity::node::tests::meets_reputation_above_threshold' (48209) panicked at synapse-core/src/identity/node.rs:221:9:
assertion failed: node.meets_reputation(50)

---- identity::node::tests::meets_reputation_at_threshold stdout ----

thread 'identity::node::tests::meets_reputation_at_threshold' (48210) panicked at synapse-core/src/identity/node.rs:228:9:
assertion failed: node.meets_reputation(100)

failures:
    identity::node::tests::meets_reputation_above_threshold
    identity::node::tests::meets_reputation_at_threshold

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
