*** synapse-core/src/identity/node_id.rs:27:22: replace != with == in NodeId::from_hex

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace != with == in NodeId::from_hex
@@ -19,17 +19,17 @@
         let hash: [u8; 32] = hasher.finalize().into();
         Self(hash)
     }
 
     /// Parses a `NodeId` from a lowercase hex string.
     ///
     /// Returns `None` if the string is not exactly 64 hex characters.
     pub fn from_hex(hex: &str) -> Option<Self> {
-        if hex.len() != 64 {
+        if hex.len() == /* ~ changed by cargo-mutants ~ */ 64 {
             return None;
         }
         let mut bytes = [0u8; 32];
         for (i, chunk) in hex.as_bytes().chunks(2).enumerate() {
             if chunk.len() != 2 {
                 return None;
             }
             let high = hex_val(chunk[0])?;

---- identity::node_id::tests::from_hex_rejects_empty stdout ----

thread 'identity::node_id::tests::from_hex_rejects_empty' (50203) panicked at synapse-core/src/identity/node_id.rs:125:9:
assertion failed: NodeId::from_hex("").is_none()

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (50207) panicked at synapse-core/src/identity/node_id.rs:102:45:
called `Option::unwrap()` on a `None` value

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (50208) panicked at synapse-core/src/identity/node_id.rs:160:61:
called `Option::unwrap()` on a `None` value

failures:
    identity::node_id::tests::from_hex_rejects_empty
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or
    identity::node_id::tests::from_hex_valid_64_chars

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
