*** synapse-core/src/identity/node_id.rs:27:9: replace NodeId::from_hex -> Option<Self> with None

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace NodeId::from_hex -> Option<Self> with None
@@ -19,29 +19,17 @@
         let hash: [u8; 32] = hasher.finalize().into();
         Self(hash)
     }
 
     /// Parses a `NodeId` from a lowercase hex string.
     ///
     /// Returns `None` if the string is not exactly 64 hex characters.
     pub fn from_hex(hex: &str) -> Option<Self> {
-        if hex.len() != 64 {
-            return None;
-        }
-        let mut bytes = [0u8; 32];
-        for (i, chunk) in hex.as_bytes().chunks(2).enumerate() {
-            if chunk.len() != 2 {
-                return None;
-            }
-            let high = hex_val(chunk[0])?;
-            let low = hex_val(chunk[1])?;
-            bytes[i] = (high << 4) | low;
-        }
-        Some(Self(bytes))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the hex-encoded `NodeId` as a 64-character string.
     pub fn to_hex(&self) -> String {
         self.0.iter().map(|b| format!("{b:02x}")).collect()
     }
 
     /// Returns the raw 32 bytes of this `NodeId`.

---- identity::node_id::tests::from_hex_valid_64_chars stdout ----

thread 'identity::node_id::tests::from_hex_valid_64_chars' (49506) panicked at synapse-core/src/identity/node_id.rs:98:9:
assertion failed: id.is_some()

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (49504) panicked at synapse-core/src/identity/node_id.rs:90:45:
called `Option::unwrap()` on a `None` value

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (49505) panicked at synapse-core/src/identity/node_id.rs:148:61:
called `Option::unwrap()` on a `None` value

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or
    identity::node_id::tests::from_hex_valid_64_chars

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
