*** synapse-core/src/identity/node_id.rs:32:28: replace != with == in NodeId::from_hex

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace != with == in NodeId::from_hex
@@ -24,17 +24,17 @@
     ///
     /// Returns `None` if the string is not exactly 64 hex characters.
     pub fn from_hex(hex: &str) -> Option<Self> {
         if hex.len() != 64 {
             return None;
         }
         let mut bytes = [0u8; 32];
         for (i, chunk) in hex.as_bytes().chunks(2).enumerate() {
-            if chunk.len() != 2 {
+            if chunk.len() == /* ~ changed by cargo-mutants ~ */ 2 {
                 return None;
             }
             let high = hex_val(chunk[0])?;
             let low = hex_val(chunk[1])?;
             bytes[i] = (high << 4) | low;
         }
         Some(Self(bytes))
     }

---- identity::node_id::tests::from_hex_valid_64_chars stdout ----

thread 'identity::node_id::tests::from_hex_valid_64_chars' (50835) panicked at synapse-core/src/identity/node_id.rs:110:9:
assertion failed: id.is_some()

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (50834) panicked at synapse-core/src/identity/node_id.rs:160:61:
called `Option::unwrap()` on a `None` value

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (50833) panicked at synapse-core/src/identity/node_id.rs:102:45:
called `Option::unwrap()` on a `None` value

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or
    identity::node_id::tests::from_hex_valid_64_chars

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
