*** synapse-core/src/identity/node_id.rs:37:36: replace | with & in NodeId::from_hex

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace | with & in NodeId::from_hex
@@ -29,17 +29,17 @@
         }
         let mut bytes = [0u8; 32];
         for (i, chunk) in hex.as_bytes().chunks(2).enumerate() {
             if chunk.len() != 2 {
                 return None;
             }
             let high = hex_val(chunk[0])?;
             let low = hex_val(chunk[1])?;
-            bytes[i] = (high << 4) | low;
+            bytes[i] = (high << 4) & /* ~ changed by cargo-mutants ~ */ low;
         }
         Some(Self(bytes))
     }
 
     /// Returns the hex-encoded `NodeId` as a 64-character string.
     pub fn to_hex(&self) -> String {
         self.0.iter().map(|b| format!("{b:02x}")).collect()
     }

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (51523) panicked at synapse-core/src/identity/node_id.rs:103:9:
assertion `left == right` failed
  left: NodeId([84, 78, 98, 206, 232, 3, 55, 9, 227, 137, 229, 178, 117, 83, 67, 208, 208, 250, 140, 72, 80, 33, 92, 251, 99, 49, 113, 126, 128, 209, 174, 163])
 right: NodeId([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (51524) panicked at synapse-core/src/identity/node_id.rs:161:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
