*** synapse-core/src/identity/node_id.rs:37:36: replace | with ^ in NodeId::from_hex

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace | with ^ in NodeId::from_hex
@@ -29,17 +29,17 @@
         }
         let mut bytes = [0u8; 32];
         for (i, chunk) in hex.as_bytes().chunks(2).enumerate() {
             if chunk.len() != 2 {
                 return None;
             }
             let high = hex_val(chunk[0])?;
             let low = hex_val(chunk[1])?;
-            bytes[i] = (high << 4) | low;
+            bytes[i] = (high << 4) ^ /* ~ changed by cargo-mutants ~ */ low;
         }
         Some(Self(bytes))
     }
 
     /// Returns the hex-encoded `NodeId` as a 64-character string.
     pub fn to_hex(&self) -> String {
         self.0.iter().map(|b| format!("{b:02x}")).collect()
     }

*** result: Success
