*** synapse-core/src/identity/node_id.rs:44:9: replace NodeId::to_hex -> String with "xyzzy".into()

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace NodeId::to_hex -> String with "xyzzy".into()
@@ -36,17 +36,17 @@
             let low = hex_val(chunk[1])?;
             bytes[i] = (high << 4) | low;
         }
         Some(Self(bytes))
     }
 
     /// Returns the hex-encoded `NodeId` as a 64-character string.
     pub fn to_hex(&self) -> String {
-        self.0.iter().map(|b| format!("{b:02x}")).collect()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the raw 32 bytes of this `NodeId`.
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }

---- identity::node_id::tests::display_is_64_char_hex stdout ----

thread 'identity::node_id::tests::display_is_64_char_hex' (54161) panicked at synapse-core/src/identity/node_id.rs:141:9:
assertion `left == right` failed
  left: 5
 right: 64

---- identity::node_id::tests::display_is_lowercase stdout ----

thread 'identity::node_id::tests::display_is_lowercase' (54162) panicked at synapse-core/src/identity/node_id.rs:152:9:
expected lowercase 'ab', got "xyzzy"

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (54167) panicked at synapse-core/src/identity/node_id.rs:102:45:
called `Option::unwrap()` on a `None` value

failures:
    identity::node_id::tests::display_is_64_char_hex
    identity::node_id::tests::display_is_lowercase
    identity::node_id::tests::from_hex_roundtrip

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
