*** synapse-core/src/identity/node_id.rs:49:9: replace NodeId::as_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace NodeId::as_bytes -> &[u8; 32] with Box::leak(Box::new([1; 32]))
@@ -41,17 +41,17 @@
 
     /// Returns the hex-encoded `NodeId` as a 64-character string.
     pub fn to_hex(&self) -> String {
         self.0.iter().map(|b| format!("{b:02x}")).collect()
     }
 
     /// Returns the raw 32 bytes of this `NodeId`.
     pub fn as_bytes(&self) -> &[u8; 32] {
-        &self.0
+        Box::leak(Box::new([1; 32])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
     match c {
         b'0'..=b'9' => Some(c - b'0'),
         b'a'..=b'f' => Some(c - b'a' + 10),
         _ => None,

---- identity::node_id::tests::as_bytes_is_the_inner_array stdout ----

thread 'identity::node_id::tests::as_bytes_is_the_inner_array' (55439) panicked at synapse-core/src/identity/node_id.rs:177:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [114, 205, 110, 132, 34, 196, 7, 251, 109, 9, 134, 144, 241, 19, 11, 125, 237, 126, 194, 247, 245, 225, 211, 11, 217, 213, 33, 240, 21, 54, 55, 147]

failures:
    identity::node_id::tests::as_bytes_is_the_inner_array

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
