*** synapse-core/src/identity/node_id.rs:54:5: replace hex_val -> Option<u8> with None

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace hex_val -> Option<u8> with None
@@ -46,21 +46,17 @@
 
     /// Returns the raw 32 bytes of this `NodeId`.
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
-    match c {
-        b'0'..=b'9' => Some(c - b'0'),
-        b'a'..=b'f' => Some(c - b'a' + 10),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.to_hex())
     }
 }

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (56111) panicked at synapse-core/src/identity/node_id.rs:98:45:
called `Option::unwrap()` on a `None` value

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (56112) panicked at synapse-core/src/identity/node_id.rs:156:61:
called `Option::unwrap()` on a `None` value

---- identity::node_id::tests::from_hex_valid_64_chars stdout ----

thread 'identity::node_id::tests::from_hex_valid_64_chars' (56113) panicked at synapse-core/src/identity/node_id.rs:106:9:
assertion failed: id.is_some()

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or
    identity::node_id::tests::from_hex_valid_64_chars

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
