*** synapse-core/src/identity/node_id.rs:54:5: replace hex_val -> Option<u8> with Some(1)

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace hex_val -> Option<u8> with Some(1)
@@ -46,21 +46,17 @@
 
     /// Returns the raw 32 bytes of this `NodeId`.
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
-    match c {
-        b'0'..=b'9' => Some(c - b'0'),
-        b'a'..=b'f' => Some(c - b'a' + 10),
-        _ => None,
-    }
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.to_hex())
     }
 }

---- identity::node_id::tests::from_hex_rejects_invalid_chars stdout ----

thread 'identity::node_id::tests::from_hex_rejects_invalid_chars' (57423) panicked at synapse-core/src/identity/node_id.rs:126:9:
assertion failed: NodeId::from_hex(&"g".repeat(64)).is_none()

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (57426) panicked at synapse-core/src/identity/node_id.rs:99:9:
assertion `left == right` failed
  left: NodeId([84, 78, 98, 206, 232, 3, 55, 9, 227, 137, 229, 178, 117, 83, 67, 208, 208, 250, 140, 72, 80, 33, 92, 251, 99, 49, 113, 126, 128, 209, 174, 163])
 right: NodeId([17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17])

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (57427) panicked at synapse-core/src/identity/node_id.rs:157:9:
assertion `left == right` failed
  left: [17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]

failures:
    identity::node_id::tests::from_hex_rejects_invalid_chars
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
