*** synapse-core/src/identity/node_id.rs:55:9: delete match arm b'0'..= b'9' in hex_val

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ delete match arm b'0'..= b'9' in hex_val
@@ -47,17 +47,17 @@
     /// Returns the raw 32 bytes of this `NodeId`.
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
     match c {
-        b'0'..=b'9' => Some(c - b'0'),
+         /* ~ changed by cargo-mutants ~ */
         b'a'..=b'f' => Some(c - b'a' + 10),
         _ => None,
     }
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.to_hex())

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (58060) panicked at synapse-core/src/identity/node_id.rs:102:45:
called `Option::unwrap()` on a `None` value

failures:
    identity::node_id::tests::from_hex_roundtrip

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
