*** synapse-core/src/identity/node_id.rs:56:31: replace - with + in hex_val

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace - with + in hex_val
@@ -48,17 +48,17 @@
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
     match c {
         b'0'..=b'9' => Some(c - b'0'),
-        b'a'..=b'f' => Some(c - b'a' + 10),
+        b'a'..=b'f' => Some(c + /* ~ changed by cargo-mutants ~ */ b'a' + 10),
         _ => None,
     }
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.to_hex())
     }

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (61385) panicked at synapse-core/src/identity/node_id.rs:103:9:
assertion `left == right` failed
  left: NodeId([84, 78, 98, 206, 232, 3, 55, 9, 227, 137, 229, 178, 117, 83, 67, 208, 208, 250, 140, 72, 80, 33, 92, 251, 99, 49, 113, 126, 128, 209, 174, 163])
 right: NodeId([84, 208, 98, 240, 8, 3, 55, 9, 3, 137, 5, 210, 117, 83, 67, 240, 240, 220, 206, 72, 80, 33, 222, 221, 99, 49, 113, 240, 128, 241, 208, 195])

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (61386) panicked at synapse-core/src/identity/node_id.rs:161:9:
assertion `left == right` failed
  left: [209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209, 209]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
