*** synapse-core/src/identity/node_id.rs:56:38: replace + with - in hex_val

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace + with - in hex_val
@@ -48,17 +48,17 @@
     pub fn as_bytes(&self) -> &[u8; 32] {
         &self.0
     }
 }
 
 fn hex_val(c: u8) -> Option<u8> {
     match c {
         b'0'..=b'9' => Some(c - b'0'),
-        b'a'..=b'f' => Some(c - b'a' + 10),
+        b'a'..=b'f' => Some(c - b'a' - /* ~ changed by cargo-mutants ~ */ 10),
         _ => None,
     }
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.to_hex())
     }

---- identity::node_id::tests::from_hex_valid_64_chars stdout ----

thread 'identity::node_id::tests::from_hex_valid_64_chars' (60706) panicked at synapse-core/src/identity/node_id.rs:56:29:
attempt to subtract with overflow

---- identity::node_id::tests::from_hex_uses_bitwise_or stdout ----

thread 'identity::node_id::tests::from_hex_uses_bitwise_or' (60705) panicked at synapse-core/src/identity/node_id.rs:56:29:
attempt to subtract with overflow

---- identity::node_id::tests::from_hex_roundtrip stdout ----

thread 'identity::node_id::tests::from_hex_roundtrip' (60704) panicked at synapse-core/src/identity/node_id.rs:56:29:
attempt to subtract with overflow

failures:
    identity::node_id::tests::from_hex_roundtrip
    identity::node_id::tests::from_hex_uses_bitwise_or
    identity::node_id::tests::from_hex_valid_64_chars

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
