*** synapse-core/src/identity/node_id.rs:63:9: replace <impl std::fmt::Display for NodeId>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- synapse-core/src/identity/node_id.rs
+++ replace <impl std::fmt::Display for NodeId>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -55,17 +55,17 @@
         b'0'..=b'9' => Some(c - b'0'),
         b'a'..=b'f' => Some(c - b'a' + 10),
         _ => None,
     }
 }
 
 impl std::fmt::Display for NodeId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.write_str(&self.to_hex())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     // --- from_public_key tests (keep existing) ---

---- identity::node_id::tests::display_is_lowercase stdout ----

thread 'identity::node_id::tests::display_is_lowercase' (62714) panicked at synapse-core/src/identity/node_id.rs:152:9:
expected lowercase 'ab', got ""

---- identity::node_id::tests::display_is_64_char_hex stdout ----

thread 'identity::node_id::tests::display_is_64_char_hex' (62713) panicked at synapse-core/src/identity/node_id.rs:141:9:
assertion `left == right` failed
  left: 0
 right: 64

failures:
    identity::node_id::tests::display_is_64_char_hex
    identity::node_id::tests::display_is_lowercase

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
