*** synapse-core/src/model/catalog.rs:31:44: replace == with != in Catalog::register

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace == with != in Catalog::register
@@ -23,17 +23,17 @@
 
     /// Registers a model in the catalog.
     ///
     /// # Errors
     ///
     /// Returns [`DomainError::DuplicateModel`] if a model with the
     /// same [`ModelId`] is already registered.
     pub fn register(&mut self, model: ModelEntity) -> Result<Vec<DomainEvent>, DomainError> {
-        if self.models.iter().any(|m| m.id == model.id) {
+        if self.models.iter().any(|m| m.id != /* ~ changed by cargo-mutants ~ */ model.id) {
             return Err(DomainError::DuplicateModel { model_id: model.id.to_string() });
         }
 
         let event = DomainEvent::ModelAdded {
             event_id: Uuid::new_v4(),
             model_id: model.id.to_string(),
             experts: model.experts,
             active_per_token: model.active_per_token,

---- model::catalog::tests::register_multiple_models stdout ----

thread 'model::catalog::tests::register_multiple_models' (64119) panicked at synapse-core/src/model/catalog.rs:177:50:
called `Result::unwrap()` on an `Err` value: DuplicateModel { model_id: "b" }

---- model::catalog::tests::list_returns_all_models stdout ----

thread 'model::catalog::tests::list_returns_all_models' (64114) panicked at synapse-core/src/model/catalog.rs:126:50:
called `Result::unwrap()` on an `Err` value: DuplicateModel { model_id: "b" }

---- model::catalog::tests::register_duplicate_rejected stdout ----

thread 'model::catalog::tests::register_duplicate_rejected' (64118) panicked at synapse-core/src/model/catalog.rs:118:68:
called `Result::unwrap_err()` on an `Ok` value: [ModelAdded { event_id: cbe11238-d810-44a7-99f5-c9225da8f478, model_id: "kimi-k3", experts: 896, active_per_token: 16 }]

failures:
    model::catalog::tests::list_returns_all_models
    model::catalog::tests::register_duplicate_rejected
    model::catalog::tests::register_multiple_models

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
