*** synapse-core/src/model/catalog.rs:31:9: replace Catalog::register -> Result<Vec<DomainEvent>, DomainError> with Ok(vec![])

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::register -> Result<Vec<DomainEvent>, DomainError> with Ok(vec![])
@@ -23,29 +23,17 @@
 
     /// Registers a model in the catalog.
     ///
     /// # Errors
     ///
     /// Returns [`DomainError::DuplicateModel`] if a model with the
     /// same [`ModelId`] is already registered.
     pub fn register(&mut self, model: ModelEntity) -> Result<Vec<DomainEvent>, DomainError> {
-        if self.models.iter().any(|m| m.id == model.id) {
-            return Err(DomainError::DuplicateModel { model_id: model.id.to_string() });
-        }
-
-        let event = DomainEvent::ModelAdded {
-            event_id: Uuid::new_v4(),
-            model_id: model.id.to_string(),
-            experts: model.experts,
-            active_per_token: model.active_per_token,
-        };
-
-        self.models.push(model);
-        Ok(vec![event])
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns all registered models.
     pub fn list(&self) -> &[ModelEntity] {
         &self.models
     }
 
     /// Finds a model by its [`ModelId`].

---- gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs stdout ----

thread 'gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs' (63329) panicked at synapse-core/src/gateway/catalog.rs:106:62:
called `Option::unwrap()` on a `None` value

---- gateway::catalog::tests::list_models_returns_non_empty_array stdout ----

thread 'gateway::catalog::tests::list_models_returns_non_empty_array' (63331) panicked at synapse-core/src/gateway/catalog.rs:94:9:
assertion failed: !models.is_empty()

---- model::catalog::tests::find_by_id stdout ----

thread 'model::catalog::tests::find_by_id' (63389) panicked at synapse-core/src/model/catalog.rs:123:39:
called `Option::unwrap()` on a `None` value

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_non_empty_array
    model::catalog::tests::find_by_id
    model::catalog::tests::list_returns_all_models
    model::catalog::tests::non_empty_catalog_is_not_empty
    model::catalog::tests::register_adds_model
    model::catalog::tests::register_duplicate_rejected
    model::catalog::tests::register_multiple_models
    model::catalog::tests::remove_existing_model

test result: FAILED. 108 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
