*** synapse-core/src/model/catalog.rs:48:9: replace Catalog::list -> &[ModelEntity] with Vec::leak(Vec::new())

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::list -> &[ModelEntity] with Vec::leak(Vec::new())
@@ -40,17 +40,17 @@
         };
 
         self.models.push(model);
         Ok(vec![event])
     }
 
     /// Returns all registered models.
     pub fn list(&self) -> &[ModelEntity] {
-        &self.models
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finds a model by its [`ModelId`].
     pub fn find(&self, id: &ModelId) -> Option<&ModelEntity> {
         self.models.iter().find(|m| m.id == *id)
     }
 
     /// Removes a model from the catalog.

---- gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs stdout ----

thread 'gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs' (64661) panicked at synapse-core/src/gateway/catalog.rs:106:62:
called `Option::unwrap()` on a `None` value

---- gateway::catalog::tests::list_models_returns_non_empty_array stdout ----

thread 'gateway::catalog::tests::list_models_returns_non_empty_array' (64663) panicked at synapse-core/src/gateway/catalog.rs:94:9:
assertion failed: !models.is_empty()

---- model::catalog::tests::list_returns_all_models stdout ----

thread 'model::catalog::tests::list_returns_all_models' (64723) panicked at synapse-core/src/model/catalog.rs:127:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_non_empty_array
    model::catalog::tests::list_returns_all_models

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
