*** synapse-core/src/model/catalog.rs:53:42: replace == with != in Catalog::find

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace == with != in Catalog::find
@@ -45,17 +45,17 @@
 
     /// Returns all registered models.
     pub fn list(&self) -> &[ModelEntity] {
         &self.models
     }
 
     /// Finds a model by its [`ModelId`].
     pub fn find(&self, id: &ModelId) -> Option<&ModelEntity> {
-        self.models.iter().find(|m| m.id == *id)
+        self.models.iter().find(|m| m.id != /* ~ changed by cargo-mutants ~ */ *id)
     }
 
     /// Removes a model from the catalog.
     ///
     /// Returns `None` if no model with the given ID was registered.
     pub fn remove(&mut self, id: &ModelId) -> Option<Vec<DomainEvent>> {
         let pos = self.models.iter().position(|m| m.id == *id)?;
         self.models.remove(pos);

---- model::catalog::tests::find_by_id stdout ----

thread 'model::catalog::tests::find_by_id' (66095) panicked at synapse-core/src/model/catalog.rs:135:39:
called `Option::unwrap()` on a `None` value

failures:
    model::catalog::tests::find_by_id

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
