*** synapse-core/src/model/catalog.rs:60:9: replace Catalog::remove -> Option<Vec<DomainEvent>> with None

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::remove -> Option<Vec<DomainEvent>> with None
@@ -52,19 +52,17 @@
     pub fn find(&self, id: &ModelId) -> Option<&ModelEntity> {
         self.models.iter().find(|m| m.id == *id)
     }
 
     /// Removes a model from the catalog.
     ///
     /// Returns `None` if no model with the given ID was registered.
     pub fn remove(&mut self, id: &ModelId) -> Option<Vec<DomainEvent>> {
-        let pos = self.models.iter().position(|m| m.id == *id)?;
-        self.models.remove(pos);
-        Some(vec![DomainEvent::ModelRemoved { event_id: Uuid::new_v4(), model_id: id.to_string() }])
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
         self.models.len()
     }
 
     /// Returns `true` if the catalog is empty.

---- model::catalog::tests::remove_existing_model stdout ----

thread 'model::catalog::tests::remove_existing_model' (66747) panicked at synapse-core/src/model/catalog.rs:159:42:
called `Option::unwrap()` on a `None` value

failures:
    model::catalog::tests::remove_existing_model

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
