*** synapse-core/src/model/catalog.rs:60:9: replace Catalog::remove -> Option<Vec<DomainEvent>> with Some(vec![])

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::remove -> Option<Vec<DomainEvent>> with Some(vec![])
@@ -52,19 +52,17 @@
     pub fn find(&self, id: &ModelId) -> Option<&ModelEntity> {
         self.models.iter().find(|m| m.id == *id)
     }
 
     /// Removes a model from the catalog.
     ///
     /// Returns `None` if no model with the given ID was registered.
     pub fn remove(&mut self, id: &ModelId) -> Option<Vec<DomainEvent>> {
-        let pos = self.models.iter().position(|m| m.id == *id)?;
-        self.models.remove(pos);
-        Some(vec![DomainEvent::ModelRemoved { event_id: Uuid::new_v4(), model_id: id.to_string() }])
+        Some(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
         self.models.len()
     }
 
     /// Returns `true` if the catalog is empty.

---- model::catalog::tests::remove_existing_model stdout ----

thread 'model::catalog::tests::remove_existing_model' (67447) panicked at synapse-core/src/model/catalog.rs:160:9:
assertion `left == right` failed
  left: 1
 right: 0

---- model::catalog::tests::remove_unknown_returns_none stdout ----

thread 'model::catalog::tests::remove_unknown_returns_none' (67448) panicked at synapse-core/src/model/catalog.rs:168:9:
assertion failed: catalog.remove(&id).is_none()

failures:
    model::catalog::tests::remove_existing_model
    model::catalog::tests::remove_unknown_returns_none

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
