*** synapse-core/src/model/catalog.rs:67:9: replace Catalog::len -> usize with 0

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::len -> usize with 0
@@ -59,17 +59,17 @@
     pub fn remove(&mut self, id: &ModelId) -> Option<Vec<DomainEvent>> {
         let pos = self.models.iter().position(|m| m.id == *id)?;
         self.models.remove(pos);
         Some(vec![DomainEvent::ModelRemoved { event_id: Uuid::new_v4(), model_id: id.to_string() }])
     }
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
-        self.models.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the catalog is empty.
     pub fn is_empty(&self) -> bool {
         self.models.is_empty()
     }
 }

---- model::catalog::tests::non_empty_catalog_is_not_empty stdout ----

thread 'model::catalog::tests::non_empty_catalog_is_not_empty' (68775) panicked at synapse-core/src/model/catalog.rs:144:9:
assertion `left == right` failed
  left: 0
 right: 1

---- model::catalog::tests::register_adds_model stdout ----

thread 'model::catalog::tests::register_adds_model' (68776) panicked at synapse-core/src/model/catalog.rs:109:9:
assertion `left == right` failed
  left: 0
 right: 1

---- model::catalog::tests::register_multiple_models stdout ----

thread 'model::catalog::tests::register_multiple_models' (68778) panicked at synapse-core/src/model/catalog.rs:179:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    model::catalog::tests::non_empty_catalog_is_not_empty
    model::catalog::tests::register_adds_model
    model::catalog::tests::register_multiple_models
    model::catalog::tests::remove_existing_model

test result: FAILED. 113 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
