*** synapse-core/src/model/catalog.rs:67:9: replace Catalog::len -> usize with 1

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::len -> usize with 1
@@ -59,17 +59,17 @@
     pub fn remove(&mut self, id: &ModelId) -> Option<Vec<DomainEvent>> {
         let pos = self.models.iter().position(|m| m.id == *id)?;
         self.models.remove(pos);
         Some(vec![DomainEvent::ModelRemoved { event_id: Uuid::new_v4(), model_id: id.to_string() }])
     }
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
-        self.models.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the catalog is empty.
     pub fn is_empty(&self) -> bool {
         self.models.is_empty()
     }
 }

---- model::catalog::tests::new_catalog_is_empty stdout ----

thread 'model::catalog::tests::new_catalog_is_empty' (69445) panicked at synapse-core/src/model/catalog.rs:101:9:
assertion `left == right` failed
  left: 1
 right: 0

---- model::catalog::tests::register_multiple_models stdout ----

thread 'model::catalog::tests::register_multiple_models' (69449) panicked at synapse-core/src/model/catalog.rs:179:9:
assertion `left == right` failed
  left: 1
 right: 3

---- model::catalog::tests::remove_existing_model stdout ----

thread 'model::catalog::tests::remove_existing_model' (69450) panicked at synapse-core/src/model/catalog.rs:162:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    model::catalog::tests::new_catalog_is_empty
    model::catalog::tests::register_multiple_models
    model::catalog::tests::remove_existing_model

test result: FAILED. 114 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
