*** synapse-core/src/model/catalog.rs:72:9: replace Catalog::is_empty -> bool with true

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::is_empty -> bool with true
@@ -64,17 +64,17 @@
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
         self.models.len()
     }
 
     /// Returns `true` if the catalog is empty.
     pub fn is_empty(&self) -> bool {
-        self.models.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn make_model(id: &str, experts: u32, active: u32) -> ModelEntity {

---- model::catalog::tests::non_empty_catalog_is_not_empty stdout ----

thread 'model::catalog::tests::non_empty_catalog_is_not_empty' (70161) panicked at synapse-core/src/model/catalog.rs:143:9:
assertion failed: !catalog.is_empty()

failures:
    model::catalog::tests::non_empty_catalog_is_not_empty

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
