*** synapse-core/src/model/catalog.rs:72:9: replace Catalog::is_empty -> bool with false

*** mutation diff:
--- synapse-core/src/model/catalog.rs
+++ replace Catalog::is_empty -> bool with false
@@ -64,17 +64,17 @@
 
     /// Returns the number of registered models.
     pub fn len(&self) -> usize {
         self.models.len()
     }
 
     /// Returns `true` if the catalog is empty.
     pub fn is_empty(&self) -> bool {
-        self.models.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn make_model(id: &str, experts: u32, active: u32) -> ModelEntity {

---- model::catalog::tests::default_catalog_is_empty stdout ----

thread 'model::catalog::tests::default_catalog_is_empty' (70923) panicked at synapse-core/src/model/catalog.rs:185:9:
assertion failed: catalog.is_empty()

---- model::catalog::tests::new_catalog_is_empty stdout ----

thread 'model::catalog::tests::new_catalog_is_empty' (70928) panicked at synapse-core/src/model/catalog.rs:100:9:
assertion failed: catalog.is_empty()

failures:
    model::catalog::tests::default_catalog_is_empty
    model::catalog::tests::new_catalog_is_empty

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
