*** synapse-core/src/model/expert_id.rs:46:9: replace <impl std::fmt::Display for ExpertId>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- synapse-core/src/model/expert_id.rs
+++ replace <impl std::fmt::Display for ExpertId>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -38,17 +38,17 @@
     /// Useful when the model's expert count is validated elsewhere.
     pub fn new_unchecked(model: ModelId, index: u32) -> Self {
         Self { model, index }
     }
 }
 
 impl std::fmt::Display for ExpertId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "{}#{}", self.model, self.index)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn kimi_model() -> ModelId {

---- model::expert_id::tests::display_format stdout ----

thread 'model::expert_id::tests::display_format' (71688) panicked at synapse-core/src/model/expert_id.rs:91:9:
assertion `left == right` failed
  left: ""
 right: "kimi-k3#42"

failures:
    model::expert_id::tests::display_format

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
