*** synapse-core/src/model/model_entity.rs:60:9: replace ModelEntity::sparsity -> f64 with -1.0

*** mutation diff:
--- synapse-core/src/model/model_entity.rs
+++ replace ModelEntity::sparsity -> f64 with -1.0
@@ -52,17 +52,17 @@
             license,
             hf_repo,
             sha256,
         }
     }
 
     /// The model's sparsity ratio: active_per_token / experts.
     pub fn sparsity(&self) -> f64 {
-        (self.active_per_token as f64) / (self.experts as f64)
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// The minimum number of nodes needed to cover all experts
     /// at `experts_per_node` experts per node.
     pub fn min_nodes_for_coverage(&self, experts_per_node: u32) -> u32 {
         self.experts.div_ceil(experts_per_node)
     }

---- model::model_entity::tests::kimi_k3_sparsity_is_below_2_percent stdout ----

thread 'model::model_entity::tests::kimi_k3_sparsity_is_below_2_percent' (73758) panicked at synapse-core/src/model/model_entity.rs:139:9:
assertion failed: (model.sparsity() - 0.01785).abs() < 0.001

---- model::model_entity::tests::mixtral_sparsity stdout ----

thread 'model::model_entity::tests::mixtral_sparsity' (73760) panicked at synapse-core/src/model/model_entity.rs:145:9:
assertion `left == right` failed
  left: -1.0
 right: 0.25

failures:
    model::model_entity::tests::kimi_k3_sparsity_is_below_2_percent
    model::model_entity::tests::mixtral_sparsity

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
