*** synapse-core/src/model/model_entity.rs:66:9: replace ModelEntity::min_nodes_for_coverage -> u32 with 0

*** mutation diff:
--- synapse-core/src/model/model_entity.rs
+++ replace ModelEntity::min_nodes_for_coverage -> u32 with 0
@@ -58,17 +58,17 @@
     /// The model's sparsity ratio: active_per_token / experts.
     pub fn sparsity(&self) -> f64 {
         (self.active_per_token as f64) / (self.experts as f64)
     }
 
     /// The minimum number of nodes needed to cover all experts
     /// at `experts_per_node` experts per node.
     pub fn min_nodes_for_coverage(&self, experts_per_node: u32) -> u32 {
-        self.experts.div_ceil(experts_per_node)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total VRAM required per node: expert_size * experts_per_node + shared_params.
     pub fn vram_per_node(&self, experts_per_node: u32) -> f64 {
         (self.expert_size_gb * experts_per_node as f64) + self.shared_params_gb
     }
 }

---- model::model_entity::tests::min_nodes_for_coverage_ceil stdout ----

thread 'model::model_entity::tests::min_nodes_for_coverage_ceil' (75705) panicked at synapse-core/src/model/model_entity.rs:152:9:
assertion `left == right` failed
  left: 0
 right: 448

failures:
    model::model_entity::tests::min_nodes_for_coverage_ceil

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
