*** synapse-core/src/model/model_entity.rs:71:30: replace * with + in ModelEntity::vram_per_node

*** mutation diff:
--- synapse-core/src/model/model_entity.rs
+++ replace * with + in ModelEntity::vram_per_node
@@ -63,17 +63,17 @@
     /// The minimum number of nodes needed to cover all experts
     /// at `experts_per_node` experts per node.
     pub fn min_nodes_for_coverage(&self, experts_per_node: u32) -> u32 {
         self.experts.div_ceil(experts_per_node)
     }
 
     /// Total VRAM required per node: expert_size * experts_per_node + shared_params.
     pub fn vram_per_node(&self, experts_per_node: u32) -> f64 {
-        (self.expert_size_gb * experts_per_node as f64) + self.shared_params_gb
+        (self.expert_size_gb + /* ~ changed by cargo-mutants ~ */ experts_per_node as f64) + self.shared_params_gb
     }
 }
 
 impl PartialEq for ModelEntity {
     fn eq(&self, other: &Self) -> bool {
         self.id == other.id
     }
 }

---- model::model_entity::tests::vram_per_node_calculation stdout ----

thread 'model::model_entity::tests::vram_per_node_calculation' (80287) panicked at synapse-core/src/model/model_entity.rs:161:9:
assertion failed: (model.vram_per_node(2) - 15.0).abs() < 0.01

failures:
    model::model_entity::tests::vram_per_node_calculation

test result: FAILED. 116 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
