*** synapse-core/src/model/model_entity.rs:77:17: replace == with != in <impl PartialEq for ModelEntity>::eq

*** mutation diff:
--- synapse-core/src/model/model_entity.rs
+++ replace == with != in <impl PartialEq for ModelEntity>::eq
@@ -69,17 +69,17 @@
     /// Total VRAM required per node: expert_size * experts_per_node + shared_params.
     pub fn vram_per_node(&self, experts_per_node: u32) -> f64 {
         (self.expert_size_gb * experts_per_node as f64) + self.shared_params_gb
     }
 }
 
 impl PartialEq for ModelEntity {
     fn eq(&self, other: &Self) -> bool {
-        self.id == other.id
+        self.id != /* ~ changed by cargo-mutants ~ */ other.id
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn kimi() -> ModelId {

---- model::model_entity::tests::different_models_not_equal stdout ----

thread 'model::model_entity::tests::different_models_not_equal' (82881) panicked at synapse-core/src/model/model_entity.rs:176:9:
assertion `left != right` failed
  left: ModelEntity { id: ModelId("kimi-k3"), name: "Kimi K3", description: "Moonshot AI frontier MoE", total_params: "2.8T", experts: 896, active_per_token: 16, expert_size_gb: 1.5, shared_params_gb: 12.0, context_window: 1000000, license: "MIT", hf_repo: "moonshotai/Kimi-K3", sha256: None }

---- model::model_entity::tests::equality_is_by_id_only stdout ----

thread 'model::model_entity::tests::equality_is_by_id_only' (82882) panicked at synapse-core/src/model/model_entity.rs:171:9:
assertion `left == right` failed
  left: ModelEntity { id: ModelId("kimi-k3"), name: "Kimi K3", description: "Moonshot AI frontier MoE", total_params: "2.8T", experts: 896, active_per_token: 16, expert_size_gb: 1.5, shared_params_gb: 12.0, context_window: 1000000, license: "MIT", hf_repo: "moonshotai/Kimi-K3", sha256: None }
 right: ModelEntity { id: ModelId("kimi-k3"), name: "Kimi K3", description: "different", total_params: "2.8T", experts: 896, active_per_token: 16, expert_size_gb: 1.5, shared_params_gb: 12.0, context_window: 1000000, license: "MIT", hf_repo: "moonshotai/Kimi-K3", sha256: None }

failures:
    model::model_entity::tests::different_models_not_equal
    model::model_entity::tests::equality_is_by_id_only

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
