*** synapse-core/src/model/model_id.rs:44:5: replace is_kebab_case -> bool with true

*** mutation diff:
--- synapse-core/src/model/model_id.rs
+++ replace is_kebab_case -> bool with true
@@ -36,38 +36,17 @@
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }
 
 /// Validates that a string is kebab-case: lowercase alphanumeric or hyphen,
 /// no leading/trailing hyphens, no consecutive hyphens.
 fn is_kebab_case(s: &str) -> bool {
-    if s.is_empty() {
-        return false;
-    }
-    let bytes = s.as_bytes();
-    // First and last must not be hyphens
-    if bytes[0] == b'-' || bytes[bytes.len() - 1] == b'-' {
-        return false;
-    }
-    let mut prev_hyphen = false;
-    for &b in bytes {
-        match b {
-            b'a'..=b'z' | b'0'..=b'9' => prev_hyphen = false,
-            b'-' => {
-                if prev_hyphen {
-                    return false; // consecutive hyphens
-                }
-                prev_hyphen = true;
-            }
-            _ => return false, // invalid character
-        }
-    }
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 impl std::fmt::Display for ModelId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.0)
     }
 }

---- model::model_id::tests::consecutive_hyphens_rejected stdout ----

thread 'model::model_id::tests::consecutive_hyphens_rejected' (84865) panicked at synapse-core/src/model/model_id.rs:106:9:
assertion failed: ModelId::new("kimi--k3").is_err()

---- model::model_id::tests::leading_hyphen_rejected stdout ----

thread 'model::model_id::tests::leading_hyphen_rejected' (84869) panicked at synapse-core/src/model/model_id.rs:96:9:
assertion failed: ModelId::new("-kimi").is_err()

---- model::model_id::tests::spaces_rejected stdout ----

thread 'model::model_id::tests::spaces_rejected' (84874) panicked at synapse-core/src/model/model_id.rs:91:9:
assertion failed: ModelId::new("kimi k3").is_err()

failures:
    model::model_id::tests::consecutive_hyphens_rejected
    model::model_id::tests::leading_hyphen_rejected
    model::model_id::tests::spaces_rejected
    model::model_id::tests::special_chars_rejected
    model::model_id::tests::trailing_hyphen_rejected
    model::model_id::tests::uppercase_rejected

test result: FAILED. 111 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
