*** synapse-core/src/model/model_id.rs:44:5: replace is_kebab_case -> bool with false

*** mutation diff:
--- synapse-core/src/model/model_id.rs
+++ replace is_kebab_case -> bool with false
@@ -36,38 +36,17 @@
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }
 
 /// Validates that a string is kebab-case: lowercase alphanumeric or hyphen,
 /// no leading/trailing hyphens, no consecutive hyphens.
 fn is_kebab_case(s: &str) -> bool {
-    if s.is_empty() {
-        return false;
-    }
-    let bytes = s.as_bytes();
-    // First and last must not be hyphens
-    if bytes[0] == b'-' || bytes[bytes.len() - 1] == b'-' {
-        return false;
-    }
-    let mut prev_hyphen = false;
-    for &b in bytes {
-        match b {
-            b'a'..=b'z' | b'0'..=b'9' => prev_hyphen = false,
-            b'-' => {
-                if prev_hyphen {
-                    return false; // consecutive hyphens
-                }
-                prev_hyphen = true;
-            }
-            _ => return false, // invalid character
-        }
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 impl std::fmt::Display for ModelId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.0)
     }
 }

---- gateway::catalog::tests::model_entries_have_required_fields stdout ----

thread 'gateway::catalog::tests::model_entries_have_required_fields' (85451) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

---- gateway::catalog::tests::list_models_returns_200 stdout ----

thread 'gateway::catalog::tests::list_models_returns_200' (85449) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

---- gateway::catalog::tests::list_models_returns_non_empty_array stdout ----

thread 'gateway::catalog::tests::list_models_returns_non_empty_array' (85450) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_200
    gateway::catalog::tests::list_models_returns_non_empty_array
    gateway::catalog::tests::model_entries_have_required_fields
    model::catalog::tests::find_by_id
    model::catalog::tests::find_unknown_returns_none
    model::catalog::tests::list_returns_all_models
    model::catalog::tests::non_empty_catalog_is_not_empty
    model::catalog::tests::register_adds_model
    model::catalog::tests::register_duplicate_rejected
    model::catalog::tests::register_multiple_models
    model::catalog::tests::remove_existing_model

test result: FAILED. 79 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
