*** synapse-core/src/model/model_id.rs:49:25: replace || with && in is_kebab_case

*** mutation diff:
--- synapse-core/src/model/model_id.rs
+++ replace || with && in is_kebab_case
@@ -41,17 +41,17 @@
 /// Validates that a string is kebab-case: lowercase alphanumeric or hyphen,
 /// no leading/trailing hyphens, no consecutive hyphens.
 fn is_kebab_case(s: &str) -> bool {
     if s.is_empty() {
         return false;
     }
     let bytes = s.as_bytes();
     // First and last must not be hyphens
-    if bytes[0] == b'-' || bytes[bytes.len() - 1] == b'-' {
+    if bytes[0] == b'-' && /* ~ changed by cargo-mutants ~ */ bytes[bytes.len() - 1] == b'-' {
         return false;
     }
     let mut prev_hyphen = false;
     for &b in bytes {
         match b {
             b'a'..=b'z' | b'0'..=b'9' => prev_hyphen = false,
             b'-' => {
                 if prev_hyphen {

---- model::model_id::tests::leading_hyphen_rejected stdout ----

thread 'model::model_id::tests::leading_hyphen_rejected' (86190) panicked at synapse-core/src/model/model_id.rs:117:9:
assertion failed: ModelId::new("-kimi").is_err()

---- model::model_id::tests::trailing_hyphen_rejected stdout ----

thread 'model::model_id::tests::trailing_hyphen_rejected' (86197) panicked at synapse-core/src/model/model_id.rs:122:9:
assertion failed: ModelId::new("kimi-").is_err()

failures:
    model::model_id::tests::leading_hyphen_rejected
    model::model_id::tests::trailing_hyphen_rejected

test result: FAILED. 115 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
