*** synapse-core/src/model/model_id.rs:55:13: delete match arm b'a'..= b'z' | b'0'..= b'9' in is_kebab_case

*** mutation diff:
--- synapse-core/src/model/model_id.rs
+++ delete match arm b'a'..= b'z' | b'0'..= b'9' in is_kebab_case
@@ -47,17 +47,17 @@
     let bytes = s.as_bytes();
     // First and last must not be hyphens
     if bytes[0] == b'-' || bytes[bytes.len() - 1] == b'-' {
         return false;
     }
     let mut prev_hyphen = false;
     for &b in bytes {
         match b {
-            b'a'..=b'z' | b'0'..=b'9' => prev_hyphen = false,
+             /* ~ changed by cargo-mutants ~ */
             b'-' => {
                 if prev_hyphen {
                     return false; // consecutive hyphens
                 }
                 prev_hyphen = true;
             }
             _ => return false, // invalid character
         }

---- gateway::catalog::tests::list_models_returns_200 stdout ----

thread 'gateway::catalog::tests::list_models_returns_200' (89369) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

---- gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs stdout ----

thread 'gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs' (89368) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

---- gateway::catalog::tests::model_entries_have_required_fields stdout ----

thread 'gateway::catalog::tests::model_entries_have_required_fields' (89371) panicked at synapse-core/src/gateway/catalog.rs:47:33:
called `Result::unwrap()` on an `Err` value: InvalidModelId { reason: "model ID must be kebab-case (lowercase letters, digits, hyphens): 'kimi-k3'" }

failures:
    gateway::catalog::tests::kimi_k3_is_listed_with_correct_specs
    gateway::catalog::tests::list_models_returns_200
    gateway::catalog::tests::list_models_returns_non_empty_array
    gateway::catalog::tests::model_entries_have_required_fields
    model::catalog::tests::find_by_id
    model::catalog::tests::find_unknown_returns_none
    model::catalog::tests::list_returns_all_models
    model::catalog::tests::non_empty_catalog_is_not_empty
    model::catalog::tests::register_adds_model
    model::catalog::tests::register_duplicate_rejected
    model::catalog::tests::register_multiple_models
    model::catalog::tests::remove_existing_model

test result: FAILED. 79 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
